# Regiment

### Introduction:

Special thanks to: http://chrisalbon.com/ for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Create the DataFrame with the following values:

In [4]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

### Step 3. Assign it to a variable called regiment.
#### Don't forget to name each column

In [9]:
regiment = pd.DataFrame(raw_data)
regiment.head()

     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
2  Nighthawks     2nd       Ali            31             57
3  Nighthawks     2nd    Milner             2             62
4    Dragoons     1st     Cooze             3             70

### Step 4. What is the mean preTestScore from the regiment Nighthawks?

In [15]:
regiment[regiment['regiment'] == 'Nighthawks'].groupby('regiment')['preTestScore'].mean()

regiment
Nighthawks    15.25
Name: preTestScore, dtype: float64

### Step 5. Present general statistics by company

In [32]:
regiment.groupby(['regiment','company']).agg({
    'preTestScore' : ['sum','mean','min','max'],
    'postTestScore' : ['sum','mean','min','max'],
    'name' : 'count'
})                                                   #.rename(columns={'count' : 'Count'})

                   preTestScore               postTestScore                \
                            sum  mean min max           sum  mean min max
regiment   company
Dragoons   1st                7   3.5   3   4            95  47.5  25  70
           2nd               55  27.5  24  31           151  75.5  57  94
Nighthawks 1st               28  14.0   4  24           119  59.5  25  94
           2nd               33  16.5   2  31           119  59.5  57  62
Scouts     1st                5   2.5   2   3           132  66.0  62  70
           2nd                5   2.5   2   3           132  66.0  62  70

                    name
                   count
regiment   company
Dragoons   1st         2
           2nd         2
Nighthawks 1st         2
           2nd         2
Scouts     1st         2
           2nd         2

### Step 6. What is the mean of each company's preTestScore?

In [38]:
regiment.groupby('company')['preTestScore'].mean() # groupby(['regiment','company'])

company
1st     6.666667
2nd    15.500000
Name: preTestScore, dtype: float64

### Step 7. Present the mean preTestScores grouped by regiment and company

In [40]:
regiment.groupby(['regiment','company'])['preTestScore'].mean()

regiment    company
Dragoons    1st         3.5
            2nd        27.5
Nighthawks  1st        14.0
            2nd        16.5
Scouts      1st         2.5
            2nd         2.5
Name: preTestScore, dtype: float64

### Step 8. Present the mean preTestScores grouped by regiment and company without heirarchical indexing

In [41]:
regiment.groupby(['regiment','company'])['preTestScore'].mean() .reset_index()

     regiment company  preTestScore
0    Dragoons     1st           3.5
1    Dragoons     2nd          27.5
2  Nighthawks     1st          14.0
3  Nighthawks     2nd          16.5
4      Scouts     1st           2.5
5      Scouts     2nd           2.5

### Step 9. Group the entire dataframe by regiment and company

In [42]:
regiment.groupby(['regiment','company'])

### Step 10. What is the number of observations in each regiment and company

In [49]:
regiment.groupby(['regiment','company']).size().reset_index(name='count')

     regiment company  count
0    Dragoons     1st      2
1    Dragoons     2nd      2
2  Nighthawks     1st      2
3  Nighthawks     2nd      2
4      Scouts     1st      2
5      Scouts     2nd      2

### Step 11. Iterate over a group and print the name and the whole data from the regiment

In [57]:
data = regiment.groupby('regiment')

for reg, group_data in data:
    print(f'name of reg ==> {reg}')
    print(group_data)
    print('\n')

name of reg ==> Dragoons
   regiment company    name  preTestScore  postTestScore
4  Dragoons     1st   Cooze             3             70
5  Dragoons     1st   Jacon             4             25
6  Dragoons     2nd  Ryaner            24             94
7  Dragoons     2nd    Sone            31             57


name of reg ==> Nighthawks
     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
2  Nighthawks     2nd       Ali            31             57
3  Nighthawks     2nd    Milner             2             62


name of reg ==> Scouts
   regiment company   name  preTestScore  postTestScore
8    Scouts     1st  Sloan             2             62
9    Scouts     1st  Piger             3             70
10   Scouts     2nd  Riani             2             62
11   Scouts     2nd    Ali             3             70